<?php
/**
 * Niushop商城系统 - 团队十年电商经验汇集巨献!
 * =========================================================
 * Copy right 2019-2029 杭州牛之云科技有限公司, 保留所有权利。
 * ----------------------------------------------
 * 官方网址: https://www.niushop.com

 * =========================================================
 */
return [
    'name' => 'supermember',
    'title' => '超级会员卡',
    'description' => '超级会员卡，增加用户粘性',
    'type' => 'tool', //插件类型  system :系统插件(自动安装), business:业务插件    promotion:扩展营销插件  tool:工具插件
    'status' => 1,
    'author' => '',
    'version' => '5.5.3',
    'version_no' => '553250709001',
    'content' => '',
];