<?php
/**
 * Niushop商城系统 - 团队十年电商经验汇集巨献!
 * =========================================================
 * Copy right 2019-2029 杭州牛之云科技有限公司, 保留所有权利。
 * ----------------------------------------------
 * 官方网址: https://www.niushop.com
 * =========================================================
 */
return [
    'name' => 'divideticket',
    'title' => '好友瓜分券',
    'description' => '邀请好友合力瓜分优惠券，所有团员获得的优惠力度相近，促进后续下单转化',
    'type' => 'promotion', //插件类型  system :系统插件(自动安装), promotion:扩展营销插件  tool:工具插件
    'status' => 1,
    'author' => '',
    'version' => '5.5.3',
    'version_no' => '553250709001',
    'content' => '',
];